In [53]:
import pandas as pd
titanic_data = pd.read_csv('titanic.csv', index_col='PassengerId')

Исследуем представленный датафрейм:

In [54]:
print(titanic_data.describe(), end="\n\n")
print("Shape: ", titanic_data.shape, end="\n\n")
titanic_data.info()
titanic_data.head()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

Shape:  (891, 11)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

При избавлении от строк с пропущенными значениями (NaN) выбрасывается слишком много строк, и при этом для правильных ответов на поставленные вопросы нам необходимы все данные, поэтому код ниже закомменитируем:

In [55]:
#titanic_data = titanic_data.dropna()
#titanic_data.info()

Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.

In [100]:
count_male = titanic_data[titanic_data["Sex"] == "male"]["Sex"].count()
count_female = titanic_data["Sex"].count() - count_male
with open("1.txt", "w") as file:
    file.write(str(count_male) + " " + str(count_female))

Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [106]:
survived_perc = round(titanic_data.describe().loc["mean", "Survived"] * 100, 2)
#titanic_data_survived = titanic_data[titanic_data["Survived"]>0]
#survived_perc = round(100 *titanic_data_survived["Survived"].count()/titanic_data["Survived"].count())
with open("2.txt", "w") as file:
    file.write(str(survived_perc))

Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [105]:
titanic_data_fcls = titanic_data[titanic_data["Pclass"]==1]
fcls_perc = round(100 * titanic_data_fcls["Pclass"].count()/titanic_data["Pclass"].count(), 2)
with open("3.txt", "w") as file:
    file.write(str(fcls_perc))

Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.

In [110]:
mean_age = round(titanic_data.describe().iloc[1, 2], 2)
med_age = titanic_data.describe().loc["50%", "Age"]
with open("4.txt", "w") as file:
    file.write(str(mean_age) + " " + str(med_age))

Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [104]:
pirs_corr_relatives = round(titanic_data.corr().loc["SibSp","Parch"], 2)
with open("5.txt", "w") as file:
    file.write(str(pirs_corr_relatives))

Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен.

In [88]:
titanic_data[titanic_data["Sex"] == "female"]["Name"].head(15)

PassengerId
2     Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                Heikkinen, Miss. Laina
4          Futrelle, Mrs. Jacques Heath (Lily May Peel)
9     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                  Nasser, Mrs. Nicholas (Adele Achem)
11                      Sandstrom, Miss. Marguerite Rut
12                             Bonnell, Miss. Elizabeth
15                 Vestrom, Miss. Hulda Amanda Adolfina
16                     Hewlett, Mrs. (Mary D Kingcome)
19    Vander Planke, Mrs. Julius (Emelia Maria Vande...
20                              Masselmani, Mrs. Fatima
23                          McGowan, Miss. Anna "Annie"
25                        Palsson, Miss. Torborg Danira
26    Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
29                        O'Dwyer, Miss. Ellen "Nellie"
Name: Name, dtype: object

In [111]:
print(count_male, count_female, "\n", survived_perc,"\n", fcls_perc, "\n", mean_age, med_age,  "\n", pirs_corr_relatives)

577 314
 38.38
 24.24
 29.7 28.0
 0.41